package solid;

public class Main {

    /*
   S
Принцип единственной ответственности (The Single Responsibility Principle)
Каждый класс, выполняет лишь одну задачу.

O
Принцип открытости/закрытости (The Open Closed Principle)
«программные сущности … должны быть открыты для расширения, но закрыты для модификации.»
L

Принцип подстановки Барбары Лисков (The Liskov Substitution Principle)
«объекты в программе должны быть заменяемыми на экземпляры их подтипов без изменения правильности выполнения программы.» См. также контрактное программирование.
Наследующий класс должен дополнять, а не изменять базовый.

I

Принцип разделения интерфейса (The Interface Segregation Principle)
«много интерфейсов, специально предназначенных для клиентов, лучше, чем один интерфейс общего назначения.»[9]
D

Принцип инверсии зависимостей (The Dependency Inversion Principle)
     */



}
